app/controllers/cocktails_controller.rb

  def create
    @cocktail = Cocktail.new(cocktail_params)
    respond_to do |format|
      if @cocktail.save
---
INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Martini"], ["created_at", "2015-11-27 11:19:37.960815"], ["updated_at", "2015-11-27 11:19:37.960815"]]

  def show
    @dose = Dose.find(params[:id])
---
SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT 1  [["id", 3]]

  def set_cocktail
    @cocktail = Cocktail.find(params[:id])
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT 1  [["id", nil]]